conf/src/InformationRegisters/ЭП_ПлановыЧасыПоЗадачам/ЭП_ПлановыЧасыПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ПлановыЧасыПоЗадачам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлановыеЧасы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗадачаПроцесса</name>
    <type>
      <types>CatalogRef.ЗадачиПроцесса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ЭП_ПлановыЧасыПоЗадачам/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("ЗадачаПроцесса") = Истина Тогда
		Запись.ЗадачаПроцесса = Параметры.ЗадачаПроцесса;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭП_ПлановыЧасыПоЗадачамСрезПоследних.ПлановыеЧасы КАК ПлановыеЧасы
			|ИЗ
			|	РегистрСведений.ЭП_ПлановыЧасыПоЗадачам.СрезПоследних КАК ЭП_ПлановыЧасыПоЗадачамСрезПоследних
			|ГДЕ
			|	ЭП_ПлановыЧасыПоЗадачамСрезПоследних.ЗадачаПроцесса = &ЗадачаПроцесса";
		
		Запрос.УстановитьПараметр("ЗадачаПроцесса",  Параметры.ЗадачаПроцесса);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Запись.ПлановыеЧасы = ВыборкаДетальныеЗаписи.ПлановыеЧасы;			
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)  
	
		Оповестить("ДобавитьИтерациюПроекта", Истина, ЭтаФорма); 
		
КонецПроцедуры
